#include <stdio.h> // Підключення бібліотеки
#include <math.h>  // Підключення бібліотеки

int main() // Підключення головної функції
{
    float X, a, b; // Введення змінних
    printf("Input a and b:\n"); // Виведення тексту на екран
    scanf_s("%f%f", &a, &b); // Зчитування даних та їх запис

    if (a >= b) // Введення умови
    {
        if (b + pow(b, 2) == 0) // Введення умови
        {
            printf("Denominator (b + pow(b, 2)) != 0\n"); //Виведення тексту на екран
            return 0; //Успішне завершення програми
        }
        float a2 = exp(a / (b + pow(b, 2))); // Введення змінних
        X = a2; //Результат
    }
    else // Введення умови
    {
        if (sin(a + 1) == 0) // Введення умови
        {
            printf("Denominator sin(a + 1) != 0\n"); //Виведення тексту на екран
            return 0; //Успішне завершення програми
        }
        float b2 = (pow(a, 2) + a * b) / (sin(a + 1)); // Введення змінних
        X = b2; //Результат
    }

    printf("X = %f\n", X); // Виведення тексту на екран
    return 0; // Успішне завершення програми
}
